In [1]:
import numpy as np
import pandas as pd

c:\Users\89556\.conda\envs\pydata\lib\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.7.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

# 数据转换

## 删除重复数据

In [2]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [3]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [6]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [7]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [8]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 利用函数或映射进行数据转换

In [9]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [10]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [11]:
data['animal'] = data['food'].map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [12]:
def get_animal(x):
    return meat_to_animal[x]

In [13]:
data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替换值

In [14]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [15]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace([-999,1000], np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [17]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [18]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 重命名轴索引

In [19]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [20]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [21]:
def transform(X):
    return X[:4].upper()

In [22]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [24]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [25]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [26]:
data.rename(index={'OHIO':'INDIANA'},
            columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## 离散化和分箱

In [27]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [28]:
bins = [18,25,35,60,100]

In [30]:
age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [31]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [32]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [33]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [34]:
pd.value_counts(age_categories)

C:\Users\89556\AppData\Local\Temp\ipykernel_36340\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [35]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [36]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [37]:
data = np.random.uniform(size=20)
data

array([0.06984776, 0.19930254, 0.04029134, 0.92017023, 0.22955513,
       0.45687985, 0.54269469, 0.22015523, 0.12312696, 0.97943417,
       0.73958803, 0.72698504, 0.32767531, 0.53539354, 0.77775106,
       0.07668929, 0.46668323, 0.47494245, 0.85299136, 0.88791625])

In [38]:
pd.cut(data,4,precision=2)

[(0.039, 0.28], (0.039, 0.28], (0.039, 0.28], (0.74, 0.98], (0.039, 0.28], ..., (0.039, 0.28], (0.28, 0.51], (0.28, 0.51], (0.74, 0.98], (0.74, 0.98]]
Length: 20
Categories (4, interval[float64, right]): [(0.039, 0.28] < (0.28, 0.51] < (0.51, 0.74] < (0.74, 0.98]]

In [39]:
data = np.random.standard_normal(1000)
data

array([ 1.06327107e+00,  3.85458816e-01,  1.98442765e-01, -1.82847176e+00,
       -1.14500818e+00,  4.02181439e-01,  2.21207985e-02, -1.01865451e+00,
        9.42599921e-02,  6.14232384e-01,  1.00831338e-01,  1.09987238e+00,
       -1.40382430e-01,  1.76104979e-01, -1.91995590e+00, -3.52749897e-01,
        2.78794984e-01, -7.48629092e-01,  3.83955145e-01,  6.82804434e-01,
       -1.05660662e+00,  7.95095307e-01, -7.44524605e-01, -1.56317007e+00,
        9.85924505e-03,  1.29256494e+00, -9.03630358e-01, -8.04594798e-01,
        4.23335466e-01, -1.73378133e+00, -9.63633560e-01, -6.13579136e-01,
       -9.22416088e-01,  9.27675239e-01,  5.16191536e-01, -9.66332990e-01,
       -2.20983053e+00, -2.75872515e-01,  2.25523564e-01, -1.98778392e-01,
        8.95675347e-01, -1.06902528e+00, -1.23286470e-01,  7.22449253e-01,
        8.46224230e-01,  6.04252868e-02, -4.75109435e-01, -4.03397559e-02,
        1.23859714e+00,  1.00174577e+00, -1.32365638e+00,  3.96568014e-01,
       -1.86309056e-01, -3.54315260e-01, -1.46401022e+00,  1.01712216e+00,
       -8.73784860e-01, -2.54294528e+00,  8.39448759e-01, -6.41721565e-01,
        2.14322366e-02,  7.54210225e-01, -1.07436788e+00,  1.51720785e+00,
       -2.00860606e+00,  4.56852543e-01, -1.29800851e+00,  4.78005998e-01,
        1.63732186e+00,  1.64197730e+00, -8.82674009e-01, -2.43263528e+00,
       -1.22136183e+00, -5.02239695e-01, -6.04242775e-01, -5.12332166e-01,
        8.23159228e-01,  6.06080002e-01, -4.11941586e-01, -5.96919623e-01,
       -9.36994365e-01, -1.51957820e+00, -9.26305893e-01,  2.71079792e-01,
       -2.91561713e-01, -4.20762138e-01,  1.39829507e+00,  1.49992299e+00,
       -1.47177348e-01,  1.07047320e+00, -2.00109816e+00,  1.31279942e+00,
        1.35497031e+00,  1.44270602e+00,  2.92608631e-01,  7.80186165e-02,
        1.95858217e-01, -6.75848966e-01,  1.35030396e+00,  9.50041137e-01,
       -2.60525540e+00,  1.07385758e-01,  1.19824276e-01, -1.57176491e+00,
       -6.51630264e-01, -1.74327109e-01, -8.23386263e-01, -8.40727662e-02,
       -1.68652581e-01,  1.18300012e+00, -2.08122749e+00,  5.38956807e-01,
        4.28698752e-01, -1.21600970e+00,  1.59699534e+00,  6.69296898e-01,
        3.81250882e-01,  3.01884163e-01,  9.68684068e-01,  2.07740640e+00,
        8.30461911e-01, -3.94939706e-01, -1.31262945e+00, -4.80776086e-01,
        1.24343142e+00,  1.81308749e-01,  3.75439912e-01, -6.31638252e-01,
       -2.21374896e-01, -6.49562313e-01,  1.39003799e+00,  1.83792646e+00,
        8.86085331e-01, -1.54624473e+00,  4.46308401e-01,  1.97077764e+00,
       -1.09476723e+00,  8.56086966e-01, -7.65366495e-01, -2.89423358e+00,
        8.84479829e-01,  3.37769141e-01, -1.14526250e+00, -1.10370822e-01,
       -4.99846836e-01,  6.54296294e-01,  1.20765221e+00, -2.79244156e+00,
        1.58475854e-03, -6.87924026e-01, -1.59490041e+00,  1.08745029e-01,
        3.40423964e-01,  5.43013840e-01,  1.51154689e+00,  4.65262361e-01,
       -2.11102893e+00, -1.12351307e+00,  2.68879113e-01,  1.61155452e+00,
       -1.20354072e+00,  1.93985520e+00,  3.75565074e-02,  2.75183291e-01,
        1.44883306e+00,  2.68988570e-01, -3.39598946e-01,  4.50285096e-01,
        4.53563640e-01,  3.94261520e-01, -2.43969646e+00,  3.18523709e-01,
       -5.05576623e-01,  1.22676807e+00, -3.60565834e-01,  1.95143739e+00,
        7.20783225e-01, -1.33346349e+00,  1.75905442e+00,  1.91575375e-01,
        4.44438043e-01,  5.13651106e-01, -7.82783373e-01, -8.35625932e-01,
        8.92702174e-01, -1.12696844e+00, -2.32866958e-01,  6.64588328e-02,
        1.29399290e-01,  2.21593747e-01,  1.02360262e-01,  1.02681826e+00,
        2.96638907e-01, -5.92717790e-01,  4.50767086e-01,  3.98470763e-01,
       -1.29453326e+00, -9.59210874e-01, -9.47036530e-01,  1.22731431e-02,
       -4.86500825e-01, -4.28114073e-01,  6.29132912e-01,  1.28815423e+00,
       -8.68908155e-01, -6.62808626e-01,  4.06525211e-03, -6.28017882e-03,
        1.38886536e+00, -2.69723293e-01, -6.62690694e-01,  3.61241267e-01,
        3.98637464e-01,  7.77948734e-01,  4.51873891e-01,  3.99122226e-01,
        1.40312875e+00, -1.30698419e+00,  1.04998407e-01,  6.10110631e-01,
       -5.99722556e-01,  5.07551004e-01,  7.57764927e-01,  8.90127246e-01,
       -3.55278553e-01, -5.14662645e-01,  1.58859629e+00,  8.52161809e-01,
       -4.59074561e-01,  2.44882985e-01,  1.65560599e-01,  1.79245938e+00,
       -5.04852008e-01,  1.60655484e+00,  2.52596660e-01, -2.31642756e-01,
        1.24615836e+00, -2.00006256e+00,  1.48099532e+00, -5.17547983e-01,
       -5.53296671e-01,  1.84647943e-01, -5.13047336e-01,  2.63285015e+00,
       -7.60011022e-02, -5.65081843e-01, -1.21264239e+00, -8.20719409e-01,
        3.11938299e+00,  9.15135960e-02, -5.72399105e-01,  5.88537646e-01,
        3.23742019e-01,  2.34457256e-01, -1.15765112e+00, -1.09159429e+00,
        1.83523335e-01,  6.30069872e-01,  8.54793259e-01, -1.29047551e+00,
       -5.23425290e-01,  5.00035696e-01, -4.95032392e-01,  1.95284268e+00,
       -6.32085287e-01,  2.51260119e-01, -1.19747005e+00, -2.09315647e-01,
        1.13100856e+00,  4.54907282e-01,  6.10763044e-01,  1.23801600e+00,
        1.36500840e+00, -1.15439600e+00,  1.74478721e+00,  8.57681784e-01,
        6.47726642e-03,  1.78920877e+00,  1.43706227e+00,  1.87028573e-01,
        5.84843178e-01, -3.32436950e-01, -2.20183445e-01,  1.27598035e+00,
       -1.43304159e+00,  4.64403393e-01, -1.37427994e+00, -1.41575550e-01,
        5.12923332e-01, -1.65401628e+00,  8.18252960e-01,  1.13015811e+00,
        1.63285911e+00, -8.99650765e-01, -1.84960388e+00,  7.61204205e-01,
        4.31897064e-01,  2.17945460e+00,  2.81494750e-01, -1.56061677e-01,
       -1.34757951e+00,  8.17738814e-01,  5.54624593e-01, -6.03544544e-02,
       -6.71080074e-01, -1.95599588e+00, -1.07379172e+00,  3.87633553e-01,
        1.00261140e+00, -7.30066497e-01, -1.20923241e+00,  9.01441167e-01,
        3.57749050e-01, -4.03554333e-01, -2.12807519e-01,  1.73617851e+00,
       -6.39055280e-02,  1.13247382e+00, -1.52251446e+00, -2.82258658e-01,
       -3.33334987e-01, -5.86409108e-01, -5.32956908e-01,  2.14167411e-01,
       -1.00731423e-01,  2.22131739e+00,  1.24836802e+00, -1.64650308e+00,
        5.67395487e-01, -1.02994118e+00,  7.23667954e-01, -5.82025805e-01,
       -3.71498935e-01, -9.50541033e-01,  1.35537044e+00, -9.23856685e-01,
       -6.07367131e-01, -9.37157626e-01,  6.96988907e-01, -4.51355784e-01,
        1.42800730e+00,  2.65094447e-01, -6.93160071e-03,  9.84774146e-01,
       -6.07986972e-01, -1.21371796e+00,  1.33447279e+00,  1.35982330e+00,
        1.16051691e+00, -1.88613517e+00, -4.90884054e-01, -8.37462542e-01,
       -9.58920588e-01,  6.26059932e-01,  4.09167715e-01,  7.24987922e-01,
       -6.49045225e-01,  9.00238360e-01, -5.55610988e-01, -2.37390619e-01,
        5.29592291e-01, -9.53114632e-02,  3.81746783e-01,  3.87118108e-01,
       -3.49549120e-01, -1.23680618e+00,  2.90683442e-01, -5.01074083e-01,
        2.82161762e-01, -8.62973188e-02, -1.13270609e+00,  7.85537590e-02,
        1.48153721e+00, -5.49545363e-01, -7.68199522e-01, -3.03604086e-01,
       -4.59617710e-01,  9.29476895e-01,  3.62377803e-01,  2.37027996e-02,
        1.06345233e+00,  5.59253220e-03,  8.46647804e-01, -2.60722302e-02,
       -1.66401743e-01,  3.32578930e-01,  6.38173161e-01, -1.80222015e-01,
        4.78122597e-01,  1.27798710e-02,  1.53092621e-02, -1.18773733e+00,
        1.06777298e+00,  1.15517223e-01, -1.99452901e-01,  2.75725588e-01,
        1.14296318e+00, -5.53607368e-01,  4.77501890e-01,  1.26333249e+00,
        4.49677261e-01, -1.42019345e+00, -7.66420898e-01,  1.71125017e-01,
       -4.08598428e-01, -2.67824716e-01,  3.71851503e-01,  6.91022290e-01,
       -6.04909678e-01, -1.89747603e+00, -1.20005003e+00,  1.55190199e+00,
        1.12008074e+00, -7.34863013e-01, -6.65090961e-01, -1.00127210e+00,
       -8.18833564e-01,  7.51234589e-02, -2.51700035e-01,  1.97910988e-01,
        6.94912384e-01, -1.81454672e+00, -1.23647448e+00, -8.58670363e-01,
       -1.48397743e-01,  2.88675680e+00,  1.60249620e+00,  1.96627690e+00,
       -3.94512587e-01,  1.14265936e-01,  1.91429662e+00, -1.85740323e+00,
       -6.57189501e-01, -7.14478975e-01,  6.21887633e-02, -8.69876454e-01,
       -6.24191711e-01, -2.09970825e+00, -1.17384434e+00, -2.41609439e-01,
        1.09512711e-01, -1.09587721e+00, -1.57910182e+00,  7.72088776e-01,
       -4.98365409e-01, -9.24894007e-01, -1.28174965e+00, -1.27391553e+00,
        6.40076789e-01, -9.90931555e-01,  2.73417741e-01,  3.44593979e-01,
       -1.50011212e+00,  9.91942326e-01,  3.89344470e-01, -5.46017773e-01,
       -4.61896729e-01,  4.87145770e-01,  1.68815728e+00, -5.05155093e-01,
        7.93443165e-01, -9.04360241e-01,  9.35281519e-02,  1.32151939e+00,
        8.55560649e-01,  1.07448427e+00,  1.22880319e+00,  1.61484630e+00,
       -7.08160827e-01,  1.66701731e-01,  2.17419214e-02,  9.32026103e-01,
       -2.04560334e+00, -4.93141924e-01, -2.73761577e-02,  9.96061117e-01,
       -8.09820081e-01, -4.48131009e-01,  5.07368987e-01,  1.17060680e-01,
       -2.56083692e-01,  7.90212076e-01,  3.91981487e-01, -6.93911425e-01,
       -1.31295190e+00, -7.43144281e-01, -3.80831293e-01, -4.94288673e-01,
       -8.79755952e-01, -1.59340302e-01, -1.15794956e+00, -6.31162785e-01,
        1.00172132e+00,  5.66137726e-01, -1.26943267e+00, -6.21120824e-01,
       -3.37897700e-01, -2.22656851e+00, -9.82913435e-01, -1.69280416e-01,
        6.70473691e-01,  1.81384136e+00,  2.48977096e+00,  7.90433133e-01,
       -1.00943254e+00,  5.34008608e-01,  3.67476519e-02, -1.16485516e+00,
        5.12059579e-01, -2.30030686e-01,  1.41559150e-01, -7.83600597e-01,
        2.69899707e+00, -2.43591343e+00,  1.25239949e-02,  3.18148710e-01,
       -7.39170807e-01,  1.22408059e-01,  2.37847103e-01, -4.73313835e-01,
       -9.13932151e-01,  1.07662286e+00,  1.46677044e+00,  4.41365556e-01,
        6.33497583e-01, -1.51682045e+00, -3.22612448e-01, -8.61690746e-01,
        1.33998856e+00, -1.22447400e+00, -2.77562706e-01, -2.14917848e-02,
       -2.30291034e+00, -6.87595261e-01, -7.38929325e-01,  3.05983728e-01,
       -2.00505333e+00, -1.92754442e-01, -5.15323391e-01,  1.58344812e+00,
        4.95863723e-01, -1.30917483e+00, -3.06976139e-02,  2.76039257e+00,
        1.35933708e-01,  3.93183836e-01, -4.21677550e-01, -1.33450377e+00,
       -2.80097885e-01,  6.09102458e-01,  6.74475027e-01, -3.70475677e-01,
       -4.68291314e-01, -3.40297672e-01,  2.57858884e+00, -3.28503756e-01,
       -1.18476891e+00,  2.66650779e-01,  8.77471233e-01,  6.88062655e-01,
        1.55248156e+00,  1.05182643e+00,  1.54364795e+00,  1.56479968e+00,
        9.12479471e-01, -1.06677307e+00,  8.63131780e-02, -1.21979379e+00,
       -2.23086794e-01,  2.22046186e-01,  4.78885386e-01,  2.97305955e+00,
        1.55323274e+00,  2.09859483e+00, -8.63804379e-01, -2.98181553e-01,
       -6.12908028e-02,  2.24709909e+00,  1.07134684e-01, -8.08100658e-01,
       -1.16093178e+00,  5.79996328e-01,  2.33732042e+00,  2.04884169e+00,
        1.13464141e+00, -6.80775691e-01, -9.42451187e-01,  1.33688689e+00,
       -2.16345375e-01,  7.02863942e-01, -1.19776478e+00, -1.64662507e+00,
        2.23219647e-01,  5.78736571e-01,  1.57941056e+00,  1.38113597e+00,
       -7.76936747e-02, -1.08484769e+00, -3.98693641e-02,  4.37646485e-01,
        8.02271608e-01, -2.67640876e-01,  7.72074890e-02, -1.29524344e+00,
       -9.33119372e-01,  2.13249628e-01, -4.40633209e-01, -1.12434058e+00,
       -6.81587339e-01,  5.33235405e-01,  1.19767514e+00,  1.17045536e+00,
       -2.96706725e-01,  8.39944809e-01, -8.40752705e-01, -2.73505360e+00,
        7.98228649e-01, -9.45337112e-01, -6.43799527e-02, -9.89525007e-01,
        1.00905409e+00, -5.11661456e-01, -6.97209315e-02, -1.43153053e-01,
       -5.13553326e-01, -1.46279183e+00,  5.25105474e-01,  1.34158981e-01,
       -8.53569577e-01,  7.55925417e-01, -6.21090104e-01,  1.13409592e+00,
       -1.19476202e+00, -7.13721958e-01,  1.07457367e+00, -5.46668169e-01,
        7.68178558e-01, -3.20893959e-01,  1.27617550e+00,  1.79508390e-01,
        6.22347801e-01, -1.20533789e-01, -8.73833455e-01,  4.59813246e-01,
        1.39110216e-01,  5.44788415e-01, -3.27758500e-01, -1.30771708e-01,
        6.31661258e-01, -7.12919560e-01,  1.59118838e+00,  4.85771716e-01,
        3.60235635e-01, -8.49294863e-01,  4.34032387e-01, -1.55346750e+00,
        2.48547051e-01,  1.03277995e+00,  5.99148719e-01,  9.65381620e-01,
        8.07713750e-02, -1.42269628e-02,  2.38302578e-02,  7.39857504e-01,
       -1.60659339e+00, -4.26337672e-01,  2.12842545e+00, -1.11705614e+00,
       -1.13253874e+00, -8.10005715e-01,  1.00618671e+00,  8.98192410e-01,
        1.00473820e+00, -4.80586306e-01,  5.82758833e-01, -2.28641379e+00,
       -1.28965307e+00,  3.61360995e-02, -7.83664603e-01, -1.38800514e+00,
        5.17144386e-01,  1.95699969e+00,  6.39697514e-03,  2.65748239e-01,
       -2.28966506e+00, -3.73704099e-01, -9.06748349e-02, -1.43062584e+00,
       -2.15219985e+00,  6.66774063e-01,  5.00266648e-01,  1.61545398e+00,
       -1.07041907e-01, -1.33890961e+00, -9.76048641e-01,  2.30430564e-01,
        1.25700463e+00,  2.15470905e-01, -4.02098844e-01, -2.67775722e-01,
       -2.98058865e-01,  4.97541426e-01,  2.09122637e-01,  1.43851556e+00,
       -5.22269185e-01,  7.38019035e-01,  4.47117632e-02,  2.18533019e-01,
        8.71831894e-02,  1.14616435e+00,  1.92469185e+00, -1.31649475e+00,
       -1.64061731e+00,  4.57323218e-01,  7.43439215e-01, -8.74887389e-01,
        1.91934842e+00, -1.03713995e+00, -7.63165393e-01, -1.75163865e+00,
       -1.93134047e+00,  9.40040493e-01,  1.15147887e+00,  2.18238760e-01,
        4.30921778e-01,  1.21900035e+00,  2.03745271e-01,  1.12844783e+00,
        8.25225847e-01,  1.07369466e+00,  5.06388163e-01,  8.82307191e-03,
       -1.35863317e+00,  1.92217123e+00, -9.77212806e-01, -3.78782418e-01,
        1.20450535e+00, -2.28890630e+00, -9.06693133e-01, -1.89767807e-01,
       -7.25036264e-01,  4.72765246e-01, -3.28651091e-01,  1.54552364e+00,
        1.37773080e+00,  3.65808633e-01, -4.59160377e-01,  2.34752537e-01,
       -4.33233914e-01,  9.33974936e-01, -3.43623492e-01,  2.10473371e+00,
       -1.25994592e+00,  6.84718316e-01,  6.86631700e-01,  1.77806887e+00,
       -2.40309865e-01,  6.75823776e-01,  3.43671881e-01, -1.36858141e+00,
       -6.79166055e-01, -8.42798135e-02,  2.09537813e-01,  2.79266990e-01,
        4.43580713e-01,  7.22385298e-01,  5.94518353e-01,  1.16360578e+00,
       -1.47435951e+00,  4.06177653e-01, -3.38825439e-01,  9.33247003e-01,
        1.30589181e+00, -2.28136971e-02,  1.81020395e-01, -1.33363657e+00,
        6.23410122e-01,  3.10048589e-01,  6.45390214e-02, -3.21289828e-01,
       -1.09617248e+00, -5.18610064e-01, -1.38074874e+00,  7.84950473e-01,
        4.51581561e-01, -4.38732193e-01,  1.69156895e+00, -1.54143368e+00,
       -8.74644872e-01, -2.41652250e-01, -1.83077603e-01,  1.02876671e+00,
       -9.11395683e-01,  6.84668643e-01, -1.05085902e+00, -7.71254135e-02,
        9.33336931e-01,  3.74699097e-01,  2.49069826e-01, -8.10717668e-01,
       -1.43066110e+00,  1.34646984e+00,  9.73978157e-01,  2.81722531e-01,
        1.56653052e+00, -9.90610213e-01, -7.48641501e-01,  4.46319085e-01,
       -8.94676599e-01, -1.58630018e+00,  7.47119352e-01,  1.99617201e-01,
       -1.03555172e-01,  1.33275038e+00,  1.49798477e+00,  1.46609795e+00,
       -8.50194722e-01,  5.22771003e-01, -2.79610926e-02, -1.35103120e+00,
       -5.83997426e-01, -2.21696471e-01, -2.36352579e-01, -4.47120322e-02,
        5.12444424e-01,  1.30248948e+00,  4.93046579e-01,  2.99310680e-01,
       -3.27459692e-01, -3.48047067e-01, -6.57753337e-01, -3.82306689e-01,
       -1.28830414e+00, -1.18871588e+00,  7.61075779e-01,  1.03011473e+00,
       -7.98190054e-01, -2.12753998e+00,  9.10564046e-01, -9.85810974e-02,
        3.63130923e-01, -6.71346242e-01, -6.02222568e-01, -1.17082880e+00,
        7.68356305e-01,  7.59462135e-01,  1.23308190e+00,  5.85355552e-01,
        4.76119381e-01, -1.76244902e+00, -1.36413793e-01,  1.42864301e+00,
        1.53980877e+00, -1.43418391e+00, -1.80456796e+00, -8.19261194e-01,
        2.54122603e-02, -6.51793795e-01, -5.66132370e-01, -2.62100498e+00,
        5.44935167e-01, -1.07417604e+00,  3.92996094e-01,  1.16774613e+00,
       -4.80176232e-01, -6.74778169e-01,  6.92610131e-01,  1.05238164e-01,
       -9.78033628e-01, -2.62369250e-01,  2.12572584e-01,  5.51008742e-01,
        7.82955038e-01, -5.90527184e-01,  6.18373831e-01,  7.33833356e-01,
        1.05823600e+00, -1.01688003e+00, -8.25055763e-01, -1.15619538e+00,
       -1.22872247e+00,  4.68198382e-01, -5.81015086e-01,  2.63876355e+00,
       -2.81315069e+00, -7.64297970e-01, -3.11589739e-02, -4.28489381e-01,
       -1.05528516e+00,  1.67401325e+00, -7.71926251e-01,  8.04667518e-02,
        1.47925168e+00,  9.16884659e-01, -1.63879782e+00, -1.03260252e+00,
        9.02398255e-01, -1.14663130e+00,  1.44965519e+00, -2.97134028e-01,
       -1.38310244e+00,  2.42986803e+00,  1.56556155e-01, -4.45207202e-01,
       -1.42278370e+00, -6.81407632e-02, -2.33050276e+00, -3.83820911e-02,
        8.01597772e-01, -8.85540104e-01,  4.47949447e-01,  8.69392669e-01,
        6.40618073e-01, -7.53702063e-01, -3.74518108e-01,  9.24210407e-01,
        8.35603520e-02,  4.34136399e-01, -3.65360855e-01, -5.46922297e-01,
       -2.05864455e+00,  1.08437331e+00,  1.52797691e+00, -1.06560362e+00,
       -9.15975383e-01,  3.40635332e-01, -1.80596606e-01,  3.51707200e-01,
        1.37185586e-01,  6.54522860e-01, -5.01827081e-02, -9.22922778e-01,
       -2.83862893e-01, -2.56550441e-01,  1.24373770e+00, -1.88122575e-01,
        5.56922741e-01,  9.72346370e-02,  5.68157169e-01,  2.53118455e+00,
       -5.27329284e-01,  8.22744291e-01,  4.30366528e-01, -4.18006248e-02,
       -1.11663995e-01, -1.42053321e+00,  4.51662877e-01,  4.33111046e-01,
        6.29489771e-01, -7.80329742e-01,  5.53371711e-01, -1.47017161e+00,
        1.14113504e-01, -1.87656181e+00,  1.53412175e+00,  1.29957836e+00,
       -1.53116591e+00,  4.31386213e-02, -1.49985608e+00, -6.03287939e-01,
        2.58676741e-01,  1.23511982e-02,  1.14337143e+00, -2.83938241e-02,
       -1.47657976e+00, -5.08036356e-01, -5.73959068e-01, -1.49078600e+00,
        8.10326326e-02,  5.71880645e-01, -8.51017256e-01, -9.74594573e-01,
       -1.33435500e-01,  8.76575163e-01,  1.86508244e-02, -7.41577892e-01,
       -1.90332218e+00,  4.32327973e-01,  4.46587232e-01, -1.78716377e+00,
       -1.53310716e+00,  2.80089190e-01,  1.87994729e-01,  1.79306621e+00,
       -4.07878059e-01,  1.85482985e+00, -7.34504888e-01, -3.96136750e-01,
        5.86891214e-01,  6.69570206e-01, -1.05655876e+00,  3.15059696e-01,
       -1.27529248e+00, -8.44590690e-01,  1.17018203e+00,  1.00534441e+00,
       -1.29718925e+00,  3.33508959e-01,  5.96863661e-01, -1.46853400e-01])

In [40]:
quartiles = pd.qcut(data, 4, precision=2)
quartiles

[(0.67, 3.12], (0.022, 0.67], (0.022, 0.67], (-2.9, -0.72], (-2.9, -0.72], ..., (0.67, 3.12], (-2.9, -0.72], (0.022, 0.67], (0.022, 0.67], (-0.72, 0.022]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.9, -0.72] < (-0.72, 0.022] < (0.022, 0.67] < (0.67, 3.12]]

In [41]:
pd.value_counts(quartiles)

C:\Users\89556\AppData\Local\Temp\ipykernel_36340\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-2.9, -0.72]     250
(-0.72, 0.022]    250
(0.022, 0.67]     250
(0.67, 3.12]      250
Name: count, dtype: int64

In [42]:
pd.qcut(data,q=[0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.895, -1.291]    100
(-1.291, 0.0219]    400
(0.0219, 1.307]     400
(1.307, 3.119]      100
Name: count, dtype: int64

## 检测和过滤异常值

In [48]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.039454    -0.036982     0.044259     0.038391
std       0.968075     0.983761     1.023245     0.996786
min      -3.106627    -3.295916    -3.433710    -3.073357
25%      -0.699981    -0.690549    -0.637777    -0.666484
50%      -0.045239    -0.024084     0.048570     0.036582
75%       0.609515     0.605793     0.735484     0.678169
max       3.163747     2.917209     2.755586     3.234486

In [49]:
col = data[2]

In [50]:
col[col.abs()>3]

148   -3.272335
225   -3.110891
947   -3.433710
Name: 2, dtype: float64

In [51]:
data[(data.abs()>3).any(axis='columns')]

            0         1         2         3
13  -0.648557 -0.832875 -0.679235 -3.073357
33   3.163747  1.138627 -0.557788  0.165835
73  -1.788994 -3.295916 -0.208570  1.638487
148  0.076846  0.194928 -3.272335 -1.040419
225 -0.322562 -1.800585 -3.110891 -1.896953
332 -3.106627  0.555091  0.671089 -1.571477
356 -0.087782  0.818327 -0.201055  3.064923
622  1.373286 -2.667502  0.229121  3.234486
659  3.002807 -0.527970 -0.424943  1.008211
947 -0.031744 -0.426388 -3.433710 -0.190504

In [52]:
data[data.abs()>3] = np.sign(data)*3

In [53]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.039514    -0.036686     0.045076     0.038164
std       0.967205     0.982824     1.020674     0.995639
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.699981    -0.690549    -0.637777    -0.666484
50%      -0.045239    -0.024084     0.048570     0.036582
75%       0.609515     0.605793     0.735484     0.678169
max       3.000000     2.917209     2.755586     3.000000

In [54]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0  1.0  1.0 -1.0

## 置换和随机采样

In [56]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))

df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [89]:
sampler = np.random.permutation(5)

sampler

array([2, 4, 1, 3, 0])

In [90]:
df.take(sampler)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [91]:
df.iloc[sampler]

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [96]:
column_sample = np.random.permutation(7)
column_sample

array([2, 1, 4, 5, 6, 0, 3])

In [97]:
df.take(column_sample,axis='columns')

    2   1   4   5   6   0   3
0   2   1   4   5   6   0   3
1   9   8  11  12  13   7  10
2  16  15  18  19  20  14  17
3  23  22  25  26  27  21  24
4  30  29  32  33  34  28  31

In [114]:
df.sample(n=3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [118]:
choices = pd.Series([5,7,-1,6,4])

choices.sample(n=10,replace=True)

3    6
0    5
1    7
1    7
3    6
1    7
2   -1
1    7
2   -1
3    6
dtype: int64

## 计算指标/虚拟变量

In [120]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [121]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [122]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [123]:
df_with_dummy = df[['data1']].join(dummies)

In [124]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [126]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [127]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("../datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [128]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [129]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object